Repository: cconard96/doc
Catalog: source/locale/*/LC_MESSAGES/advanced/status.po
Languages: pt_br

source: GLPI Status Monitoring
pt_br: Monitoramento do status do GLPI

source: GLPI contains a helpful endpoint for monitoring its health at `/status.php` and the `glpi:system:status` CLI command. The `/status.php` endpoint does not require you to be logged in and therefore only shows basic status information. Sensitive information like the GLPI version and plugin names and versions (could be used to identify vulerabilities) are not shown. The difference with the CLI command though is that since it isn't accessible from the web, you can optionally retrieve private information too.
pt_br: O GLPI contém um endpoint útil para monitorar sua integridade em `/status.php` e o comando CLI `glpi:system:status` .O endpoint `/status.php` não exige que você esteja logado e mostra apenas informações básicas de status. Informações confidenciais, como a versão do GLPI e os nomes e versões do plug-in (podem ser usadas para identificar vulnerabilidades), não são mostradas. A diferença com o comando CLI, porém, é que, como não é acessível pela Web, você também pode recuperar informações privadas.

source: Services
pt_br: Serviços

source: The status of GLPI is separated into multiple "services". These services can be listed using the `glpi:system:list_services` CLI command.
pt_br: O status do GLPI é separado em vários "serviços". Esses serviços podem ser listados usando o comando CLI `glpi:system:list_services` .

source: A non exhaustive list of services available:
pt_br: Uma lista não exaustiva de serviços disponíveis:

source: db - Database (Main and replicants)
pt_br: db - Banco de Dados (Principal e replicantes)

source: imap - Email Server(s)
pt_br: imap - Servidor(es) de e-mail

source: mail_collectors - Email collectors
pt_br: mail_collectors - Coletores de email

source: crontasks - Automatic actions
pt_br: crontasks - Ações automáticas

source: filesystem - Filesystem access
pt_br: filesystem - Acesso ao sistema de arquivos

source: plugins - Plugins status
pt_br: plugins - Status dos plugins

source: By default, the `/status.php` endpoint provides a plain-text output of the public status information. The plain-text output is deprecated in favor of the JSON format, but it remains the default for backwards compatibility.
pt_br: Por padrão, o endpoint `/status.php` fornece uma saída de texto simples das informações públicas de status. A saída de texto simples foi preterida em favor do formato JSON, mas continua sendo o padrão para compatibilidade com versões anteriores.

source: The following formats are currently supported and can be chosen by using the HTTP `Accept` header or the `format` query parameter. When using the `format` parameter, the short format identifier should be used.
pt_br: Os seguintes formatos são atualmente suportados e podem ser escolhidos usando o cabeçalho HTTP `Accept` ou o parâmetro de consulta `format`. Ao usar o parâmetro `format`, o identificador de formato curto deve ser usado.

source: Format parameter - json
pt_br: Parâmetro de formato - JSON

source: Plain-text (deprectated)
pt_br: Texto plano (depreciado)

source: Format parameter - plain
pt_br: Parâmetro de formato - simples

source: You can filter the output to a specific service using the `service` query parameter.
pt_br: Você pode filtrar a saída para um serviço específico usando o parâmetro de consulta `service`.

source: CLI Command
pt_br: Linha de comando

source: Similar to the `/status.php` endpoint, the CLI command `glpi:system:status` only shows the public status information by default. However, since this tool is not available from the web interface, you may add the `-p` or `--private` option to see all of the status information.
pt_br: Semelhante ao terminal `/status.php`, o comando CLI `glpi:system:status` mostra apenas as informações públicas de status por padrão. No entanto, como esta ferramenta não está disponível na interface da web, você pode adicionar a opção `-p` ou `--private` para ver todas as informações de status.

source: By default, it uses the plain-text format for its output for backwards compatibility, but this is deprecated. The same formats are supported as listed above in the "Status Endpoint" section and the short identifier can be passed in the `-f` or `--format` option.
pt_br: Por padrão, ele usa o formato de texto simples para sua saída para compatibilidade com versões anteriores, mas está obsoleto. Os mesmos formatos são suportados conforme listado acima na seção "Status Endpoint" e o identificador curto pode ser passado na opção `-f` ou `--format`.

source: You can filter the output to a specific service using the `-s` or `--service` option.
pt_br: Você pode filtrar a saída para um serviço específico usando a opção `-s` ou `--service`.
