Repository: cconard96/doc
Catalog: source/locale/*/LC_MESSAGES/first-steps/access-glpi.po
Languages: pt_br

source: Administering access controls
pt_br: Administrando controles de acesso

source: This section describes how to administer the access control system that allows each user to access a specific context of use.
pt_br: Esta seção descreve como administrar o sistema de controle de acesso que permite a cada usuário acessar um contexto específico de uso.

source: In GLPI each user does not have access to the same interface nor to the same same functionalities. For each user, a specific context of use is determined, which grants them access only to the functionalities and information that is needed. Access to identity information about the user allows us to determine his or her authorizations.
pt_br: No GLPI cada usuário não tem acesso à mesma interface nem às mesmas funcionalidades. Para cada utilizador é determinado um contexto de utilização específico, que lhe permite aceder apenas às funcionalidades e informações necessárias. O acesso às informações de identidade do usuário nos permite determinar suas autorizações.

source: The first step is to configure the desired authentication method(s). GLPI is able to manage user authentication and information completely locally in its database, however it is recommended to delegate the authentication to an external service like LDAP. See :doc:`Configuring authentication methods <../modules/configuration/authentication/index>` for more information.
pt_br: A primeira etapa é configurar o(s) método(s) de autenticação desejado(s). O GLPI é capaz de gerenciar a autenticação e as informações do usuário de forma totalmente local em seu banco de dados, porém é recomendável delegar a autenticação a um serviço externo como o LDAP.Veja :doc:`Configuring authentication methods <../modules/configuration/authentication/index>` para mais informações.

source: The import or creation of new users and management of users known to GLPI including deletion, syncronization, activation/deactivation and management of information such as email, phone, etc is covered in :doc:`the user administration documentation <../modules/administration/users/users>`.
pt_br: A importação ou criação de novos usuários e gerenciamento de usuários conhecidos pelo GLPI, incluindo exclusão, sincronização, ativação/desativação e gerenciamento de informações como e-mail, telefone, etc. :doc:`the user administration documentation <../modules/administration/users/users>`.

source: A user can associated with groups, entities, and profiles which are the means of determining usage contexts.
pt_br: Um usuário pode ser associado a grupos, entidades e perfis que são os meios de determinar os contextos de uso.

source: Groups allow users to be grouped according to similarities in skills or organizational units. See :doc:`Administering groups <../modules/administration/groups>` for more information.
pt_br: Os grupos permitem que os usuários sejam agrupados de acordo com as semelhanças em habilidades ou unidades organizacionais. Veja :doc:`Administering groups <../modules/administration/groups>` para mais informações.

source: Entities allow you to segment your asset fleet, help desk, etc into departments that are isolated from each other. See :doc:`Administering entities <../modules/administration/entities>` for more information.
pt_br: As entidades permitem que você segmente sua frota de ativos, help desk, etc., em departamentos isolados uns dos outros. Veja :doc:`Administering entities <../modules/administration/entities>` para mais informações.

source: Profiles are sets of permissions that can be granted to users. Multiple profiles can be given to a user but only one can be active at a time. See :doc:`Administering profiles <../modules/administration/profiles/profiles>` for more information.
pt_br: Os perfis são conjuntos de permissões que podem ser concedidas aos usuários. Vários perfis podem ser atribuídos a um usuário, mas apenas um pode estar ativo por vez.Veja :doc:`Administering profiles <../modules/administration/profiles/profiles>` para mais informações.

source: Finally, you can configure :doc:`Rules for assigning authorizations to a user <../modules/administration/rules/userauthorizations>` to dynamically assign entities, groups and profiles to users.
pt_br: Finalmente, você pode configurar :doc:`Rules for assigning authorizations to a user <../modules/administration/rules/userauthorizations>` para atribuir dinamicamente entidades, grupos e perfis aos usuários.
